Laminar/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cell;

setFormat    raw;

sets
(
	reed // name of the set
	{
		type face; // type of the set
		axis y;
		start (0.0 0.0 0.0);
		end (0.0 0.0261 0.0);
	}
);
fields
(
	p
);


// *********************************************************************** //
